Autodesk.AdvanceSteel.Modelling.Grid.updateWidth(System.Double)
Update the Width of the Grid
For a Grid1D this becomes the length of each GridElement (Axis)

Autodesk.AdvanceSteel.Modelling.Grid.updateLength(System.Double)
Update the Length of the Grid
For a Grid1D this becomes the sum of all the spacings between successive GridElements (Axis)

Autodesk.AdvanceSteel.Modelling.Grid.AddSequence(System.Int32,System.Double)
Adds a sequence after the last GridElement
If the spacings between GridElements are the same as the previous sequence, the two sequences will be combined into one

Autodesk.AdvanceSteel.Modelling.Grid.GetNumSequences
Gets the number of sequences in the Grid

Autodesk.AdvanceSteel.Modelling.Grid.GetAllElements(Autodesk.AdvanceSteel.Modelling.GridElement[]@)
Gets all of the Grid's elements, including neighbors
Each element contains information about an axis and it's label

Autodesk.AdvanceSteel.Modelling.Grid.getNumElements
Gets the number of elements in the Grid